'use strict';

module.exports = async (strapi) => {
  try {
    const count = await strapi.entityService.count(
      'api::information.information'
    );

    if (count > 0) {
      console.log("ℹ️ Informations already exist");
      return;
    }

    const informations = [

      // ================= ข่าว 1 =================
      {
        title: "กิจกรรมนำเสนอและแลกเปลี่ยนงานวิจัยระหว่างนักศึกษา Chuo University และ ภาควิชาฯ IoTE สจล.",
        excerpt: "เปิดเวทีแลกเปลี่ยนงานวิจัยระดับนานาชาติ! นักศึกษา IoTE สจล. และ Chuo University ร่วมโชว์ผลงานและต่อยอดแนวคิดทางวิชาการอย่างสร้างสรรค์",
        full_content: [
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "เมื่อวันที่ 9 กุมภาพันธ์ ที่ผ่านมา ภาควิชาวิศวกรรมไอโอทีและสารสนเทศ คณะวิศวกรรมศาสตร์ สจล. ร่วมกับ Chuo University จัดกิจกรรมแลกเปลี่ยนทางวิชาการ โดยมีนักศึกษาจากทั้งสองสถาบันจำนวน 34 คน เข้าร่วมนำเสนอผลงานวิจัยและแลกเปลี่ยนมุมมองทางวิชาการร่วมกันอย่างเข้มข้นและสร้างสรรค์"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "กิจกรรมครั้งนี้ได้รับเกียรติจาก Prof. Dr. Jun Lio จาก Chuo University และ ผศ.ดร.เกล็ดดาว สัตย์เจริญ จากภาควิชาวิศวกรรมไอโอทีและสารสนเทศ สจล. ร่วมเป็นผู้ดำเนินรายการและให้ข้อเสนอแนะอย่างใกล้ชิด ซึ่งบรรยากาศเต็มไปด้วยการเรียนรู้และความร่วมมือ เพื่อเป็นแนวทางให้นักศึกษาสามารถนำไปต่อยอดและพัฒนางานวิจัยให้มีประสิทธิภาพยิ่งขึ้นในอนาคต"
            }]
          }
        ],
        date: new Date(),
      },

      // ================= ข่าว 2 =================
      {
        title: "ขอแสดงความยินดีกับทีม DemocraSee! นักศึกษา IoTE สจล. คว้า 2 รางวัลใหญ่จากเวที “Hackathon ปราบซื้อเสียง” โดย กกต.",
        excerpt: "สุดปัง! นวัตกรคนรุ่นใหม่แห่ง IoTE สจล. โชว์พลังไอเดียสร้างสรรค์นวัตกรรมแก้ปัญหาการซื้อเสียง โดนใจทั้งกรรมการและมหาชน คว้า 2 รางวัลใหญ่จากเวทีระดับประเทศ! 🚀",
        full_content: [
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "ภาควิชาวิศวกรรมไอโอทีและสารสนเทศ คณะวิศวกรรมศาสตร์ สจล. ขอแสดงความชื่นชมและร่วมยินดีกับทีมนักศึกษาคนเก่งของเรา ในชื่อทีม \"DemocraSee\" ที่สามารถคว้ารางวัลจากการแข่งขันสุดท้าทาย ณ มหาวิทยาลัยธรรมศาสตร์ ศูนย์รังสิต มาได้สำเร็จ! 👏"
            }]
          },
          {
            type: "list",
            format: "unordered",
            children: [
              { type: "list-item", children: [{ type: "text", text: "🥈 รางวัลรองชนะเลิศอันดับที่ 1" }] },
              { type: "list-item", children: [{ type: "text", text: "🌟 รางวัล Popular Vote" }] }
            ]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "👥 โฉมหน้าคนเก่ง สมาชิกทีม DemocraSee:"
            }]
          },
          {
            type: "list",
            format: "unordered",
            children: [
              { type: "list-item", children: [{ type: "text", text: "นายวีระภัทร แสงอรุณ" }] },
              { type: "list-item", children: [{ type: "text", text: "นายพรเกียรติ รอบคอบ" }] },
              { type: "list-item", children: [{ type: "text", text: "นายณัฐพัชร์ เจียรยุทธศักดิ์" }] },
              { type: "list-item", children: [{ type: "text", text: "นายพันวินทร์ ชุติกาญจนโรจน์" }] },
              { type: "list-item", children: [{ type: "text", text: "นายโกเมศ ประกอบผล" }] }
            ]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "💡 การแข่งขันในครั้งนี้ มุ่งเน้นการนำเสนอ “ไอเดีย วิธีการ และนวัตกรรม” เพื่อร่วมแก้ไขปัญหาการซื้อเสียงให้แก่ประชาชนและสำนักงานคณะกรรมการการเลือกตั้ง (กกต.) อย่างสร้างสรรค์และสามารถนำไปใช้ได้จริงเป็นรูปธรรม"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "ขอชื่นชมในความตั้งใจและศักยภาพของนักศึกษาทุกคนที่ร่วมกันสร้างสรรค์ผลงานยอดเยี่ยมชิ้นนี้ขึ้นมา ภาควิชาฯ ขอเป็นกำลังใจให้ทุกคนพัฒนาฝีมือต่อไป และคว้าความสำเร็จในเวทีอื่นๆ ในอนาคตครับ!"
            }]
          }
        ],
        date: new Date(),
      },

      // ================= ข่าว 3 =================
      {
        title: "รับสมัคร นศ. ป.ตรี วิศวะฯ IoT & IT ลาดกระบัง (ปิดรับ 20 ม.ค. 69)",
        excerpt: "🚨 โค้งสุดท้าย! #Dek69 ห้ามพลาด โอกาสก้าวสู่การเป็นนวัตกรด้าน IoT และ IT ที่วิศวฯ ลาดกระบัง ยื่นพอร์ตด่วน วันสุดท้าย 20 ม.ค. 69 นี้! 🏃‍♂️💨",
        full_content: [
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "โอกาสสุดท้ายแล้วนะน้องๆ #Dek69! 📢 ใครที่มีพอร์ตพร้อม ใจพร้อม และเป้าหมายชัดเจนว่าอยากเรียน \"วิศวกรรมไอโอทีและสารสนเทศ\" ที่ สจล. ต้องรีบยื่นใบสมัครด่วนๆ เลยครับ!"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "📍 เปิดรับสมัคร: ภาควิชาวิศวกรรมไอโอทีและสารสนเทศ คณะวิศวกรรมศาสตร์ สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง (สจล.)"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "⏰ หมดเขต: 20 มกราคม 2569 (ย้ำเตือน! อย่ารอยื่นนาทีสุดท้ายนะ ระบบอาจจะหน่วงได้ รีบเลย!)"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "👇 ช่องทางการสมัครและรายละเอียด:"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "🔗 จิ้มลิงก์สมัครเลยที่นี่: https://admission.reg.kmitl.ac.th/"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "📖 อ่านประกาศรับสมัคร: https://www.reg.kmitl.ac.th/TCAS_old/news/files/2569_1_news1_4112_2025_11_11-12-54-28_46fcd.pdf?fbclid=IwY2xjawQTWklleHRuA2FlbQIxMABicmlkETE5Zm1UVzU4QU9sU2J1Tms0c3J0YwZhcHBfaWQQMjIyMDM5MTc4ODIwMDg5MgABHv0vOcCmpF5CK6jzdOk8uELcLVh0_s9x1GCYthckYAElVJmB2iVv111qYtVV_aem_5FN7KQesnGuINokXP5ohPg"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "(*หน้า 23 เป็นต้นไป ฉบับเพิ่มเติม)"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "เตรียมพอร์ตให้เป๊ะ แล้วมาก้าวสู่ครอบครัว IoTE ด้วยกันนะครับ! 💻✨"
            }]
          }
        ],
        date: new Date(),
      },

      // ================= ข่าว 4 =================
      {
        title: "🏆 คณะวิศวฯ สจล. ขอแสดงความยินดีกับ \"ศ.ดร.อภิรัฐ ศิริธราธิวัตร\" คว้ารางวัลนักวิจัยดีเด่นแห่งชาติ ประจำปี 2569",
        excerpt: "\"ความภาคภูมิใจสูงสุดแห่งวิศวฯ ลาดกระบัง! เชิดชูเกียรตินักวิจัยผู้สร้างสรรค์นวัตกรรมแห่งอนาคต 'ศาสตราจารย์ ดร.อภิรัฐ ศิริธราธิวัตร' กับรางวัลเกียรติยศระดับประเทศ จากสำนักงานการวิจัยแห่งชาติ (วช.)\"",
        full_content: [
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "คณะวิศวกรรมศาสตร์ สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง (สจล.) ขอแสดงความยินดีและร่วมเชิดชูเกียรติ “ศาสตราจารย์ ดร.อภิรัฐ ศิริธราธิวัตร” ในโอกาสที่ได้รับการคัดเลือกให้รับ รางวัลนักวิจัยดีเด่นแห่งชาติ ประจำปี 2569 ในสาขาวิศวกรรมศาสตร์และอุตสาหกรรมวิจัย จากสำนักงานการวิจัยแห่งชาติ (วช.)"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "รางวัลดังกล่าวถือเป็นรางวัลอันทรงเกียรติที่มอบให้แก่นักวิจัยผู้ที่ได้อุทิศตนเพื่อสร้างสรรค์ผลงานที่มีคุณค่าและเป็นประโยชน์ต่อประเทศชาติอย่างต่อเนื่อง โดย ศาสตราจารย์ ดร.อภิรัฐ ศิริธราธิวัตร เป็นผู้ที่มีความเชี่ยวชาญด้านอุตสาหกรรมวิจัยทางวิศวกรรมไฟฟ้า และมีผลงานที่โดดเด่นครอบคลุมการพัฒนาในหลากหลายมิติ ได้แก่:"
            }]
          },
          {
            type: "list",
            format: "unordered",
            children: [
              { type: "list-item", children: [{ type: "text", text: "(1) อุตสาหกรรมฮาร์ดดิสก์ไดรฟ์: การวิจัยและพัฒนาเพื่อเพิ่มขีดความสามารถทางเทคโนโลยี" }] },
              { type: "list-item", children: [{ type: "text", text: "(2) อุตสาหกรรมการเกษตร: การนำนวัตกรรมทางวิศวกรรมมาประยุกต์ใช้เพื่อยกระดับการเกษตร" }] },
              { type: "list-item", children: [{ type: "text", text: "(3) เครื่องจักรกลไฟฟ้าที่ใช้กำลังไฟฟ้า: การพัฒนาและออกแบบเครื่องจักรกลไฟฟ้าให้มีประสิทธิภาพสูงสุด" }] },
              { type: "list-item", children: [{ type: "text", text: "(4) ระบบไฟฟ้ากำลัง: การเพิ่มประสิทธิภาพและความเสถียรในการส่งจ่ายในระบบไฟฟ้ากำลัง" }] },
              { type: "list-item", children: [{ type: "text", text: "(5) นวัตกรรมด้านสุขภาพ: การนำองค์ความรู้ทางวิศวกรรมมาเพิ่มประสิทธิภาพในการดูแลสุขภาพและการแพทย์" }] },
              { type: "list-item", children: [{ type: "text", text: "(6) เทคโนโลยีปัญญาประดิษฐ์ (AI): การประยุกต์ใช้ AI เพื่อพัฒนาคุณภาพชีวิตและยกระดับมาตรฐานการศึกษาให้ก้าวไกล" }] }
            ]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "คณะวิศวกรรมศาสตร์ สจล. ขอแสดงความชื่นชมในความมุ่งมั่น ทุ่มเท และความสำเร็จอันยิ่งใหญ่ในครั้งนี้ ซึ่งผลงานของท่านไม่เพียงแต่สร้างชื่อเสียงให้กับสถาบันฯ แต่ยังเป็นกำลังสำคัญในการขับเคลื่อนสังคมและพัฒนาอุตสาหกรรมของประเทศไทยให้ก้าวหน้าอย่างยั่งยืนต่อไป"
            }]
          }
        ],
        date: new Date(),
      },

      // ================= ข่าว 5 =================
      {
        title: "นักศึกษา IoT วิศวลาดกระบัง คว้ารางวัลชมเชย SMART FACTORY Hackathon 2025",
        excerpt: "IoT for Industry: นักศึกษาวิศวลาดกระบังสร้างสรรค์นวัตกรรมในเวที Smart Factory",
        full_content: [
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "ภาควิชาวิศวกรรมไอโอทีและสารสนเทศ คณะวิศวกรรมศาสตร์ สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "ขอแสดงความยินดีกับนักศึกษาที่ได้รับ รางวัลชมเชย 🏅 จากการแข่งขัน SMART FACTORY Hackathon 2025"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "จัดขึ้นเมื่อวันที่ 15 ธันวาคม 2568 ณ บริษัท โซนี่ ดีไวซ์ เทคโนโลยี (ประเทศไทย) จังหวัดปทุมธานี"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "👥 ทีม Alice in Wonderland"
            }]
          },
          {
            type: "list",
            format: "unordered",
            children: [
              { type: "list-item", children: [{ type: "text", text: "นางสาวณปภัช พรรณศิลป์ (67010253)" }] },
              { type: "list-item", children: [{ type: "text", text: "นางสาวอันนา สิงห์สถิตย์ (67011043)" }] },
              { type: "list-item", children: [{ type: "text", text: "นางสาวญาดาวดี กลิ่นสมิทธิ์ (67011430)" }] }
            ]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "👥 ทีม Factory Reset"
            }]
          },
          {
            type: "list",
            format: "unordered",
            children: [
              { type: "list-item", children: [{ type: "text", text: "นายณัฐวินท์ แต้มประเสริฐ (67050168)" }] },
              { type: "list-item", children: [{ type: "text", text: "นายธีรภัทร ราชปัก (67050248)" }] },
              { type: "list-item", children: [{ type: "text", text: "นายรติภัทร บัวแก้ว (67050465)" }] }
            ]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "👩‍🏫 อาจารย์ที่ปรึกษา: ผู้ช่วยศาสตราจารย์สรพงษ์ วชิรรัตนพรกุล"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "การแข่งขันครั้งนี้เปิดโอกาสให้นักศึกษาได้ประยุกต์องค์ความรู้ด้าน IoT และวิศวกรรมสู่การแก้ปัญหาในบริบทโรงงานอุตสาหกรรมจริง สะท้อนถึงความสามารถในการคิดวิเคราะห์ การทำงานเป็นทีม และการพัฒนานวัตกรรมเพื่ออุตสาหกรรมยุคใหม่"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "ที่มา : https://web.facebook.com/share/p/18NBjd3jaJ/"
            }]
          }
        ],
        date: new Date(),
      },

      // ================= ข่าว 6 =================
      {
        title: "ความสำเร็จครั้งสำคัญ! IoT KMITL คว้ารางวัล The Huawei National ICT Competition 2025–2026",
        excerpt: "เวทีระดับประเทศ พิสูจน์ศักยภาพนักศึกษา IoT สู่มาตรฐานสากล",
        full_content: [
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "ภาควิชาวิศวกรรมไอโอทีและสารสนเทศ คณะวิศวกรรมศาสตร์ สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "ขอแสดงความยินดีกับ นายวิวรรธน์ สุวรรณสิทธิ์ (66010769) จากทีม M.I.T ที่ได้รับ รางวัลชนะเลิศ (🥇) Network Track"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "ในการแข่งขัน The Huawei National ICT Competition Awards 2025–2026"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "จัดขึ้นเมื่อวันที่ 18 ธันวาคม 2568 ณ หัวเว่ย เทคโนโลยี (ประเทศไทย) อาคาร G Tower Grand Rama 9 กรุงเทพมหานคร"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "โดยมี ผู้ช่วยศาสตราจารย์นิจจารีย์ สัตยารักษ์ เป็นอาจารย์ที่ปรึกษา"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "ความสำเร็จครั้งนี้สะท้อนถึงศักยภาพ ความตั้งใจ และความสามารถของนักศึกษาในด้านระบบเครือข่ายและเทคโนโลยีสารสนเทศ พร้อมทั้งแสดงให้เห็นถึงคุณภาพการเรียนการสอนของภาควิชาฯ ที่มุ่งพัฒนานักศึกษาให้ก้าวสู่เวทีการแข่งขันระดับประเทศและระดับสากล"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "ที่มา : https://web.facebook.com/share/p/17BEfMMT5g/"
            }]
          }
        ],
        date: new Date(),
      },

      // ================= ข่าว 7 =================
      {
        title: "นักศึกษา IoT วิศวลาดกระบัง คว้ารางวัลนวัตกรไซเบอร์ระดับชาติ 2568",
        excerpt: "พลังคนรุ่นใหม่กับผลงาน AI ที่ตอบโจทย์อุตสาหกรรมความมั่นคงปลอดภัยไซเบอร์",
        full_content: [
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "นักศึกษาภาควิชาวิศวกรรมไอโอทีและสารสนเทศ คณะวิศวกรรมศาสตร์ สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "ได้รับ รางวัลนวัตกรด้านความมั่นคงปลอดภัยไซเบอร์รุ่นใหม่ จาก สำนักงานคณะกรรมการการรักษาความมั่นคงปลอดภัยไซเบอร์แห่งชาติ ในการประกวด Thailand Cyber Security Product and Service Awards 2025 ประจำปี 2568 ซึ่งเป็นรางวัลในระดับชาติ"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "🏆 ผลงานที่ได้รับรางวัล"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "AI-Based Network Scanning Analysis System ระบบวิเคราะห์การสแกนเครือข่ายด้วยเทคโนโลยีปัญญาประดิษฐ์ (AI)"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "👨‍💻 นักศึกษาผู้พัฒนา"
            }]
          },
          {
            type: "list",
            format: "unordered",
            children: [
              { type: "list-item", children: [{ type: "text", text: "นายชินวัตร ศิลาธนสาร" }] },
              { type: "list-item", children: [{ type: "text", text: "นายฐิติพันธุ์ สอนโคตร" }] },
              { type: "list-item", children: [{ type: "text", text: "นายอภิรัก จีนทั่ง" }] }
            ]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "โดยมี ผศ.ดร.อรรถพล ป้อมสถิตย์ เป็นอาจารย์ที่ปรึกษา"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "พิธีมอบรางวัลจะจัดขึ้นในวันอังคารที่ 23 ธันวาคม 2568 ณ ทีเค. พาเลซ แอนด์คอนเวนชั่น กรุงเทพมหานคร"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "ความสำเร็จครั้งนี้สะท้อนถึงศักยภาพของนักศึกษาด้านวิศวกรรมไอโอทีและสารสนเทศ ที่สามารถพัฒนานวัตกรรมสอดคล้องกับความต้องการของอุตสาหกรรมและความมั่นคงไซเบอร์ของประเทศ"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "ที่มา : https://web.facebook.com/share/p/1BKLLtzRaQ/"
            }]
          }
        ],
        date: new Date(),
      },

      // ================= ข่าว 8 =================
      {
        title: "วิศวลาดกระบังคว้ารางวัลนักวิจัยดีเด่นแห่งชาติ 2569 สร้างชื่อเสียงระดับประเทศ",
        excerpt: "ตอกย้ำศักยภาพงานวิจัยไทย ที่พัฒนาองค์ความรู้สู่การใช้ประโยชน์จริง",
        full_content: [
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "Wow! #วิศวลาดกระบัง คว้ารางวัลนักวิจัยดีเด่นแห่งชาติ 2569 ตอกย้ำพลังนวัตกรรมจากห้องแล็บสู่ระดับประเทศ"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "คณะวิศวกรรมศาสตร์ สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง ขอแสดงความยินดีกับ คณาจารย์ และนักวิจัย ในโอกาสได้รับการยกย่อง ผลงานนวัตกรรมเด่นจากการประกาศผลรางวัลนักวิจัยดีเด่นแห่งชาติ ประจำปี 2569 โดย สำนักงานการวิจัยแห่งชาติ (วช.)"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "โอกาสนี้ได้รับเกียรติจาก ศาสตราจารย์ ดร.อุมา สีบุญเรือง รองคณบดีฝ่ายวิจัย คณะวิศวกรรมศาสตร์ ร่วมแสดงความยินดีและให้กำลังใจแก่อาจารย์ และนักวิจัย ภายในงาน วันนักประดิษฐ์ ประจำปี 2569"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "ความสำเร็จในครั้งนี้สะท้อนถึงศักยภาพ ความมุ่งมั่น และความแข็งแกร่งของระบบวิจัยและนวัตกรรมของวิศวลาดกระบัง ที่สามารถพัฒนางานวิจัยจากห้องปฏิบัติการไปสู่การใช้ประโยชน์ได้จริง สร้างผลกระทบเชิงบวกทั้งในมิติของสังคม เศรษฐกิจ และการพัฒนาประเทศในระดับชาติและนานาชาติ"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "นี่คืออีกหนึ่งบทพิสูจน์ของ วิศวกรรมศาสตร์ สจล. ในการเป็นกำลังสำคัญของประเทศด้านงานวิจัย เทคโนโลยี และนวัตกรรมอย่างยั่งยืน 🚀"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "----------------"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "รายชื่อผู้ได้รับรางวัล"
            }]
          },
          {
            type: "list",
            format: "ordered",
            children: [
              { type: "list-item", children: [{ type: "text", text: "รศ.ดร.ณัฐพล ฤกษ์เกษมสันติ์ (อาจารย์ประจำภาควิชาวิศวกรรมเคมี) 🥇รางวัลผลงานประดิษฐ์คิดค้น - สาขาวิศวกรรมศาสตร์และอุตสาหกรรมวิจัย - ผลงานเรื่อง “สารป้องกันไฟป่าระยะยาวจากสารธรรมชาติ” (Natural Long-Term Flame-Retardant)" }] },
              { type: "list-item", children: [{ type: "text", text: "ศ.ดร.อภิรัฐ ศิริธราธิวัตร (อาจารย์ประจำภาควิชาวิศวกรรมไอโอทีและสารสนเทศ) 🥇รางวัลพระราชทาน “นักวิจัยดีเด่นแห่งชาติ สาขาวิศวกรรมศาสตร์และอุตสาหกรรมวิจัย ประจำปี พ.ศ.2569) - เป็นผู้ที่ทุ่มเทการทำวิจัยเพื่อพัฒนาอุตสาหกรรมและสังคมมาตลอด อาทิเช่น - อุตสาหกรรมฮาร์ดดิสก์ไดรฟ์ที่เป็นผู้บุกเบิกงานวิจัยด้านนี้ของประเทศไทย จนได้รับการยอมรับจากทั้งภาครัฐและอุตสาหกรรม - อุตสาหกรรมพลังงานทั้งด้านระบบไฟฟ้ากำลังและระบบเครื่องจักรกลไฟฟ้าแบบใหม่ของโลกที่มีระบบควบคุมอัจฉริยะ - อุตสาหกรรมโทรคมนาคม ที่เน้นการพัฒนาระบบการพยากรณ์ทางอวกาศ ภายใต้ร่วมมือกับ ศาสตราจารย์ ดร. พรชัย ทรัพย์นิธิ (นักวิจัยดีเด่นแห่งชาติ สาขาเทคโนโลยีสารสนเทศ ประจำปี พ.ศ. 2568)" }] },
              { type: "list-item", children: [{ type: "text", text: "ดร.สมกิจ โสพันธ์ 🥇รางวัลวิทยานิพนธ์ รางวัลระดับดี - สาขาเทคโนโลยีสารสนเทศและนิเทศศาสตร์ - วิทยานิพนธ์เรื่อง “การลดผลกระทบของการหน่วงเวลาชั้นไอโอโนสเฟียร์ ต่อระบบเสริมความแม่นยำผ่านดาวเทียม (เอสบาส) บริเวณประเทศไทย” (MITIGATION OF IONOSPHERIC DELAYS IN SATELLITE-BASED AUGMENTATION SYSTEM (SBAS) OVER THAILAND)" }] },
              { type: "list-item", children: [{ type: "text", text: "ดร.จตุพร ด้วงทอง 🥇รางวัลวิทยานิพนธ์ รางวัลระดับดี - สาขาเทคโนโลยีสารสนเทศและนิเทศศาสตร์ - วิทยานิพนธ์เรื่อง “การออกแบบรหัสแอลดีพีซีแบบโพรโทกราฟและการถอดรหัส แบบตารางสำหรับระบบสื่อสารดิจิทัล” ( Designs of Protograph LDPC Codes and Lookup TableBased Decoder for Digital Communication Systems)" }] }
            ]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "Department of Chemical Engineering, KMITL\nDepartment of IoT and Information Engineering, KMITL\nDepartment of Telecommunications Engineering, KMITL"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "#KMITL #วันนักประดิษฐ์2569 #ResearchToImpact #อาจารย์วิศวลาดกระบังได้รับรางวัล"
            }]
          },
          {
            type: "paragraph",
            children: [{
              type: "text",
              text: "ที่มา : https://web.facebook.com/share/p/1GT1Ly6vbV/"
            }]
          }
        ],
        date: new Date(),
      }

    ];

    for (const info of informations) {
      await strapi.entityService.create(
        'api::information.information',
        {
          data: {
            ...info,
            publishedAt: new Date(),
          },
        }
      );

      console.log(`✅ Created information: ${info.title}`);
    }

    console.log("🎉 Information seeding complete");

  } catch (err) {
    console.error("❌ Information Seed Error:", err);
  }
};